solvers/crystalFoam/tut/cavity/0.org/acetone
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      acetone;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    movingWall //acetone-HMX
    {
    	type            fixedValue;
    	value	    	uniform 0.12; //mass fraction due to table 1
    }
    "(fixedWalls|defaultFaces)"
    {
    	type            zeroGradient;
    }
}


// ************************************************************************* //
