solvers/crystalFoam/tut/cavity/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

blockMesh
crystalFoam > log 



# ----------------------------------------------------------------- end-of-file
