solvers/crystalFoam/tut/cavity/constant/quadratureProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      quadratureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

moments
(
    (0)
    (1)
    (2)
    (3)
    (4)
   // (5)
   // (6)
);

nodes
(
    node0{
	//nSecondaryNodes 10;
    }
    node1{
	//nSecondaryNodes 10;
    }
   // node3{
//	nSecondaryNodes 10;
 //   }
);

extendedMomentInversionCoeff
{
    extendedMomentInversion     lognormal;//gamma;//
    
    maxSigmaIter        1000;
    momentsTol          1.0e-6;
    sigmaTol            1.0e-8;
    targetFunctionTol   1.0e-8;  
}

// ************************************************************************* //
