solvers/crystalFoam/tut/cavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p_rgh|p|pFinal)"
    {
        solver           GAMG;
        tolerance        1e-10;
        relTol           0.01;

        smoother         DICGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }
    p_rghFinal
    {
	$p_rgh;
	relTol           0.0001;
     }
      
    "(U|h|e|k|epsilon|omega|R|Yi).*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
    "(h|e).*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
	maxItr		1;
    }
    "moment.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-15;
        relTol          0;
	minItr		1;
    }
    "rho.*"
    {
	solver          diagonal;
        preconditioner  none;
        tolerance       0;
        relTol          0;
    }
}

SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       1.0e5;

    residualControl
    {
        p_rgh           1e-6;
        U               1e-6;
        "(h|e)"         1e-6;

        "(k|epsilon|omega|R.*)" 1e-6;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors    1;
    nNonOrthogonalCorrectors 1;
    nCorrectors         2;
    pRefCell            0;
    pRefValue           1.0e5;
    
    residualControl
    {
        "moment.*"      
        {   
            tolerance 1e-6;
            relTol    0;
        }
    }
}
/*
relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.5;
    }
    
    equations
    {
        U               0.5;
        "(h|e)"         0.7;
        "(k|epsilon|omega|R)" 0.3;
        "moment.*"      1;
    }
}
*/

// ************************************************************************* //
